Repository: omegat-fi/B333-OmegaT
Catalog: source/OmegaT-käännösmuisti-472646.tmx
Source language: en
Languages: fi

source: The user, however, may need to generate a set of rules, specific to the project in question.
fi: Sääntöjä voidaan kuitenkin räätälöidä projektikohtaisesti.

source: Imagine having to translate something; from a single file to a folder containing subfolders each with a number of files in a variety of formats.
fi: Kuvittele kääntäväsi jotakin; yhdestä tiedostosta kansioon, joka sisältää alakansiota, joissa on useita tiedostoja monissa eri tiedostomuodoissa.

source: Press the Filter button on the bottom to limit the shown entries in the editor window to those that match the current search.
fi: Paina Suodatin-näppäintä alareunassa rajoittaaksesi näytetyt hakusanat editorissa niihin, jotka vastaavat hakua.

source: regular expressions
fi: säännölliset lausekkeet

source: Using keyword search with open file will thus find all occurrences of the string open file, as well as file opened, open input file, file may not be safe to open, etc.
fi: Avainsanahaku sanoille ”open file” löytää siis kaikki esiintymät merkkijonolle “open file”, kuten myös “file opened”, “open input file”, “file may not be safe to open” jne.

source: Options
fi: Asetukset

source: • Display: all matching segments: if checked, all the segments are displayed one by one, even if they are present several times in the same document or in different documents.
fi: • Näytä: kaikki täsmäävät segmentit: kaikki täsmäävät segmentit näytetään erikseen, vaikka osumia olisi useampi samassa asiakirjassa tai eri asiakirjoissa.

source: No action, if{j}machine tools are deactivated
fi: Toiminto ei ole käytössä, jos konekäännöstyökaluja ei ole otettu käyttöön

source: Command
fi: Komento

source: You can have several Search windows open at the same time, but close them when they are no longer needed so that they do not clutter your desktop.
fi: Sinulla voi olla useita hakuikkunoita auki samaan aikaan, mutta sulje ne, kun et enää tarvitse niitä. Näin ne eivät sekoita työpöytääsi.

source: Pressing the search button after entering a string in the search field displays all the segments in the project that include the entered string.
fi: Hakupainikkeen painaminen sen jälkeen, kun on syöttänyt merkkijonon hakukenttään, näyttää kaikki projektin segmentit, jotka sisältävät annetun merkkijonon.

source: The following search methods are available:
fi: Käytettävissä ovat seuraavat hakumenetelmät:

source: Note that '*' and '?' have special meaning in regular expressions, so wild card search, as described here, applies to exact and keyword search only (see below).
fi: Huomaa, että merkeillä ”*” ja ”?” on erityinen merkitys säännöllisissä lausekkeissa, joten tässä kuvattu jokerimerkkihaku koskee vain tarkkaa hakua ja avainsanahakua (katso alla).

source: keyword search
fi: haku avainsanoilla

source: Additionally to one of the methods above you can select the following:
fi: Edellä mainittujen menetelmien lisäksi voit valita seuraavista:

source: File Filters
fi: Tiedostosuodattimet

source: OmegaT displays a list of all segments containing all of the words specified.
fi: OmegaT näyttää listan kaikista segmenteistä, jotka sisältävät kaikki määritellyt sanat.

source: External Post-processing
fi: Ulkoinen jälkikäsittely

source: Enable Sentence-level{j}segmentation
fi: Ota käyttöön virketason segmentointi{j}

source: Translate the file
fi: Käännä tiedosto

source: When searching through files (as opposed to translation memories), OmegaT restricts the search to files in source file formats.
fi: Hakiessaan tiedostoista (käännösmuistien sijaan) OmegaT rajaa haun tiedostoihin, jotka ovat lähdetiedoston formaatissa.

source: Searches
fi: Haut

source: • Working with plain text and Working with formatted text: these two chapters explain certain important points concerning texts to be translated, such as the encoding set (in the case of plain text files) and tag handling (in the case of formatted text).
fi: Pelkän tekstin käsittely ja muotoillun tekstin käsittely: nämä kaksi kappaletta selittävät tärkeitä käännettävien tekstien ominaisuuksia, kuten koodaus (kun kyseessä on pelkkä teksti) ja merkintöjen käsittely (kun kyseessä on muotoiltu teksti).

source: Closes the current project.
fi: Sulkee nykyisen projektin.

source: The segments are displayed in order of appearance in the project.
fi: Segmentit näkyvät siinä järjestyksessä, jossa ne esiintyvät projektissa.

source: The Project → Properties...{j}(Ctrl+E) dialog is used to define and modify the project folders and languages.
fi: {j}Projekti -> Ominaisuudet (Ctrl + E) -valintaikkunaa käytetään projektikansion ja -kielten määrittämiseen ja muokkaamiseen.

source: The search string - [a-zA-Z]+[öäüqwß] - in the example above for instance looks for words in the target segment, containing questionable characters from German keyboard.
fi: Esimerkiksi haettava merkkijono - [a-zA-Z]+[öäüqwß] - edellä mainitussa esimerkissä etsii kohdesegmenteistä sanoja, jotka sisältävät epäilyttäviä merkkejä saksalaiselta näppäimistöltä.

source: internal translation memory
fi: sisäinen käännösmuisti

source: To delete project specific segmentation rules, uncheck the check box.
fi: Projektikohtaisten segmentointisääntöjen poistamiseksi poistetaan valinta.

source: OmegaT is a free multi platform Computer Aided Translation tool, with the following highlights:
fi: OmegaT on ilmainen monelle alustalle sopiva tietokoneavusteinen käännöstyökalu, jolla on seuraavat ominaisuudet:

source: The Search window has its own menus:
fi: Hakuikkunalla on omat valikkonsa:

source: Menu and Keyboard shortcuts
fi: Valikko ja pikanäppäimet

source: NB:
fi: Huom:

source: The word or phrase is entered in the Search for box automatically.
fi: Sana tai lauseke ilmestyy hakuruutuun automaattisesti.

source: The matches will be displayed in bold blue.
fi: Osumat näkyvät lihavoituna sinisellä.

source: • Project management
fi: Projektinhallinta

source: Segmentation rules ................................................................................................
fi: Segmentoinnin säännöt

source: If an Internet connection is available, various MT services such as Google Translate and Microsoft Translator can be used from within OmegaT.
fi: Mikäli internet-yhteys on käytettävissä, useat eri konekäänninpalvelut kuten Google Translate ja Microsoft Translator ovat käytettävissä OmegaT:ssä.

source: • File > Close (Ctrl+W): close the search window (in the same way as Esc)
fi: • Tiedosto > Sulje (Ctrl+W): sulje hakuikkuna (samalla tavoin kuin Esc-näppäimellä)

source: • in notes: search in notes to segments
fi: • huomautuksista: hakee segmenttien huomautuksista

source: • '*' matches zero or more characters, from the current position in a given word to its end.
fi: • “*” vastaa nollaa tai sitä useampia merkkejä sen sijainnista annetussa sanassa sanan loppuun.

source: OmegaT stores your translations in a translation memory file.
fi: OmegaT tallentaa käännöksesi käännösmuistitiedostoon.

source: Check Glossaries to include the glossaries located in the glossary folder in the search.
fi: Valitse Sanastot sisällyttääksesi sanastokansiossa sijaitsevat sanastot hakuun.

source: You can then switch back to the Search window for the next segment found, for instance to check and, if necessary, correct the terminology.
fi: Voit sitten siirtyä takaisin hakuikkunaan nähdäksesi seuraavan löydetyn segmentin esimerkiksi tarkistaaksesi ja tarvittaessa korjataksesi terminologiaa.

source: Bear in mind that changing the languages may render the currently used translation memories useless since their language pair may not longer match the new languages.
fi: Huomaa, että kielen vaihtamisesta voi seurata se, että käytössä olevasta käännösmuistista ei ole enää hyötyä, sillä kieliparit eivät vastaa uusia kieliä.

source: Save
fi: Tallenna

source: • in source: search in the source segments
fi: • lähteestä: hakee lähdesegmenteistä

source: OmegaT uses the standard tmx file format to store and access translation memories, which guarantees that you can exchange your translation material with other CAT applications supporting this file format.
fi: OmegaT käyttää standardia tmx tiedostomuotoa käännösmuistien tallentamiseen ja käyttämiseen, joka takaa, että voit vaihtaa käännösmateriaaliasi muiden tietokoneavusteisten käännössovellusten, jotka tukevat tätä tiedostomuotoa, kanssa.

source: For instance, 'run?' would match the word 'runs' and 'runn' in the word 'running'.
fi: Esimerkiksi ”run?” vastaa sana ”runs” ja “runn” sanassa ”running”.

source: Mac users should instead use the cmd+key.
fi: Mac-käyttäjien on sen sijaan käytettävä cmd-näppäintä.

source: Exports the current selection to a text file for processing.
fi: Vie valinnan käsiteltäväksi tekstitiedostoon.

source: open your source file in a text editor that correctly interprets its encoding and save the file in "UTF-8" encoding.
fi: Avaa lähdetiedosto tekstieditorissa, joka tulkitsee koodauksen oikein ja tallenna tiedosto ”UTF-8”-merkistökoodaukseen.

source: Saves the current work to the
fi: Tallentaa työn

source: OmegaT uses glossaries containing translations of single words or small phrases: a simplified bilingual dictionary for a specific domain.
fi: OmegaT käyttää yksittäisten sanojen tai pienten lauseiden muodostavia sanastoja: yksinkertaistettu kaksikielinen erikoisalan sanakirja.

source: Export Selection
fi: Vie valinta

source: • Translated: search only in translated segments.
fi: • Käännetyistä: hakee vain käännetyistä segmenteistä.

source: Click the dropdown arrow of the Search for box to access the last 10 searches.
fi: Napsauta hakuruudun pudotusvalikon nuolta saadaksesi esille 10 viimeisintä hakua.

source: 3.{j}Search methods and options
fi: 3.{j}Hakumenetelmät ja vaihtoehdot

source: Keyword searches are similar to a search "with all of the words" in an Internet search engine such as Google (AND logic).
fi: Avainsanahaut muistuttavat hakua kaikilla sanoilla internetin hakukoneissa, kuten Googlessa.

source: in the project's omegat
fi: projektin omegat-

source: OmegaT will present one segment at a time for you to translate.
fi: OmegaT antaa sinulle yhden segmentin kerrallaan käännettäväksi.

source: File locations
fi: Tiedostojen sijainnit

source: Double-clicking on a segment opens it in the Editor for modifications (one single click does it when Auto-sync with Editor option is checked).
fi: Kaksoisklikkaamalla segmenttiä se aukeaa editoriin muutoksia varten (yksi klikkaus avaa segmentin silloin kun vaihtoehto Automaattinen synkronointi editorin kanssa on valittuna).

source: Documents
fi: Asiakirjat

source: The segmentation rules are generally valid across all the projects.
fi: Segmentointisäännöt ovat yleensä voimassa kaikissa projekteissa.

source: Change the file extension from .txt to .utf8.
fi: Muuta tiedostotunniste .txt:stä .utf8:ksi.

source: In OmegaT, segments can be based on paragraphs or on segmentation rules.
fi: OmegaT:ssä segmentit voivat perustua kappaleisiin tai segmentointisääntöihin.

source: • in comments: search in comments to segments
fi: • kommenteista: hakee segmenttien kommenttiosioista

source: To remove a filter, press the Remove filter button, or reload a project.
fi: Poistaaksesi suodattimen paina Poista suodatin-painiketta tai lataa projekti uudelleen.

source: You can use normal navigation to go to e.g. the next (untranslated) segment that matches the search criteria.
fi: Normaalin navigoinnin avulla voit siirtyä esimerkiksi seuraavaan (kääntämättömään) segmenttiin, joka vastaa hakuehtoja.

source: 5.{j}Filter entries in editor according to{j}search
fi: 5.{j}Suodata hakusanoja editorissa{j}haun mukaan

source: Remove Tags
fi: Poista tagit

source: • Untranslated: search only in untranslated segments.
fi: • Kääntämättömistä: hakee vain kääntämättömistä segmenteistä.

source: As OmegaT handles identical segments as one single entity, only the first unique segment is shown.
fi: OmegaT käsittelee identtisiä segmenttejä yhtenä yksikkönä, joten vain ensimmäinen ainutlaatuinen segmentti näytetään.

source: Set up a new project
fi: Määritä uusi projekti

source: OmegaT will automatically interpret the file as a UTF-8 file.
fi: OmegaT tulkitsee automaattisesti tiedoston UTF-8-tiedostoksi.

source: • Search in Project: check Memory to include the project memory (project_save.tmx file) in the search.
fi: • Haku projektista: valitse Muisti sisällyttääksesi projektin muistin (project_save.tmx-tiedosto) hakuun.

source: An exact search looks for a phrase, i.e. if several words are entered, they are found only if they occur in exactly that sequence.
fi: Tarkka haku etsii lauseketta, toisin sanoen jos hakuun on syötetty useita sanoja, ne löytyvät vain jos ne esiintyvät juuri kyseisessä järjestyksessä.

source: • Languages: the ISO list of languages and language codes is provided
fi: Kielet: ISO-standardin luettelo kielistä ja koodeista on tarjolla

source: Search for segments containing the exact string you specified.
fi: Etsii segmentit, jotka sisältävät täsmällisesti määrittelemäsi merkkijonon.

source: 4.{j}Search results display
fi: 4.{j}Hakutulosten näyttö

source: The search string will be treated as a regular expression.
fi: Haun merkkijonoa pidetään säännöllisenä lausekkeena.

source: • File > Search for selection (Ctrl+F): refocus on the search field and select all its contents.
fi: • Tiedosto > Etsi valikoimasta (Ctrl+F): keskitä uudelleen hakukenttään ja valitse sen koko sisältö.

source: See Tokenizers Appendix for details.
fi: Lisätietoja Tunnisteet-liitteestä.

source: The predominant way of segmenting the sources is the sentence-level segmenting, so this check box should in a normal case be left checked.
fi: Virketason segmentointi on yleisin segmentointitapa, joten tämä valinta on suositeltavaa pitää valittuna.

source: 2.{j}Using wild cards
fi: 2.{j} Jokerimerkkien käyttäminen

source: • Segmentation:translation memory tools work with textual units called segments.
fi: Segmentointi: käännösmuistityökalut käsittelevät tekstinyksikköjä, joita kutsutaan segmenteiksi.

source: • Edit > Create Glossary Entry (Ctrl+Shift+G): add a new glossary item.
fi: • Muokkaa > Luo hakusana sanastoon (Ctrl+Shift+G): lisää uusi sanastokohde.

source: • '?' matches any single character.
fi: • ”?” vastaa mitä hyvänsä yksittäistä merkkiä.

source: • Keyword index: an extensive keyword index is provided to help the reader find the relevant information.
fi: Avainsanahakemisto: kattava avainsanahakemisto, joka auttaa lukijaa löytämään tarvittavat tiedot.

source: In that case, yy is the number of other occurrences of the segment in the project.
fi: Tällöin yy on se luku, kuinka monta kertaa segmentti esiintyy projektissa.

source: Regular expressions are a powerful way to look for instances of a string.
fi: Säännölliset lausekkeet ovat tehokas tapa etsiä merkkijonon esiintymiä.

source: documents in the project's
fi: asiakirjat projektin

source: (see Menu > Options >{j}Machine Translate)
fi: (ks. Valikko -> Asetukset -> {j}Konekäännös

source: Alternatively, you can select a word or phrase in the Editor pane, Fuzzy matches pane or Glossary pane and hit Ctrl+F.
fi: Voit vaihtoehtoisesti valita sanan tai lausekkeen editoriruudusta, sumean osuman ruudusta tai sanastoruudusta ja painaa Ctrl+F.

source: Upgrading translation memories ............................................................................
fi: Käännösmuistien päivittäminen

source: Project management shortcuts
fi: Projektinhallinnan pikanäppäimet

source: Right to left languages
fi: Oikealta vasemmalle luettavat kielet

source: Target folder and creates
fi: kohdekansioon ja luo

source: Create Translated
fi: Luo käännetyt

source: Consequently, although OmegaT is quite able to handle tmx files, it does not include them in the Search files search.
fi: Näin ollen, vaikka OmegaT pystyy varsin hyvin käsittelemään tmx-tiedostoja, se ei sisällä niitä hakuun tiedostoista.

source: Searching for open file will thus find all occurrences of the string open file, but not file opened or open input file.
fi: Jos siis haet sanoja “open file” löydät kaikki esiintymät merkkijonolle “open file” mutta ei “file opened” tai “open input file”.

source: • case sensitive: the search will be performed for the exact string specified; i.e. capitalization is observed.
fi: • merkkikoon huomiointi: haku tehdään täsmällisesti määritellylle merkkijonolle; toisin sanoen isot kirjaimet huomioidaan.

source: They have the meaning, familiar to Word users:
fi: Niiden merkitys on Word-ohjelman käyttäjille tuttu:

source: Changing this flag does not modify the segmentation of already existing translation memories.
fi: Asetuksen muuttaminen ei vaikuta jo olemassa olevien käännösmuistien segmentointiin.

source: Replaces the target segment{j}with the machine translation{j}of the source.
fi: Korvaa kohdesegmentin konekäännöksellä

source: • Display: file names: if checked, the name of the file where each segment is found is displayed above each result.
fi: • Näytä: tiedostonimet: jokaisen tuloksen yläpuolella näkyy tiedoston nimi, jossa segmentti sijaitsee.

source: This will effectively return them to the "untranslated" status, as they will no longer match segments recorded in the project memory, even though their original translation is still there.
fi: Tämä taas muuttaa ko. segmentit “kääntämättä”-tilaan, sillä ne eivät enää vastaa projektimuistiin tallennettuja segmenttejä, vaikka alkuperäiset käännökset ovat edelleen olemassa.

source: exact search
fi: tarkka haku

source: Replace with Machine{j}Translation
fi: Korvaa konekäännöksellä{j}

source: The open source LanguageTool can be used to correct common grammatical and stylistic mistakes.
fi: Avoimen lähdekoodin kielityökalua voidaan käyttää korjaamaan yleisiä kieliopillisia ja tyylillisiä virheitä.

source: Non-visible formatting (i.e., which doesn't appear as tags in the OmegaT editor) is retained in target documents.
fi: Näkymätön muotoilu (eli sellainen, josta ei ole tageja OmegaT-editorissa) säilytetään kohdeasiakirjoissa.

source: It is possible to modify the project properties during a translation session.
fi: Käännösistunnon aikana voi muokata projektin ominaisuuksia.

source: • Dictionaries, Glossaries, Machine translation , Spellchecker, LanguageTool:
fi: Sanakirjat, sanastot, konekäännös, oikolukija, kielityökalu:

source: (file project_save.tmx located
fi: (tiedosto project_save.tmx löytyy

source: See more in the chapter Regular Expressions.
fi: Lisätietoja luvussa Säännölliset lausekkeet.

source: On Apple keyboards the cmd key either has a command label or an Apple icon on it.
fi: Apple-näppäimistöissä cmd-näppäimessä on joko merkintä command tai Apple-symboli.

source: Shift+Ctrl+C
fi: Vaihto + Ctrl + C

source: Chapter 15.
fi: Luku 15

source: If you click on the button Advanced options additional criteria (author or changer of the translation, date translated, excluding orphan segments, etc) can be selected.
fi: Painiketta Lisäasetukset klikkaamalla voi valita lisäehtoja (käännöksen tekijä tai muuttaja, kääntämisen päivämäärä, orposegmenttien poisjättö, jne).

source: 1.{j}Search window
fi: 1.{j}Hakuikkuna

source: • Edit > Insert source (Ctrl+Shift+I): insert current segment source.
fi: • Muokkaa > Lisää lähde (Ctrl+Shift+I): lisää valitun segmentin lähde.

source: When enabled, all the formatting tags are removed from source segments.
fi: Kun tämä on valittuna, kaikki muotoilutagit poistetaan lähdesegmenteistä.

source: Ctrl+D Creates the translated
fi: CTRL + D luo käännetyt

source: Displays a dialog to locate an existing project.
fi: Avaa ikkunan olemassa olevan projektin hakemiseksi

source: Tag validation entry ..................................................................................................
fi: Merkitse validoitu syöte

source: This is especially useful when dealing with texts where inline formatting is not really useful (e.g., OCRed PDF, bad converted .odt or .docx, etc.)
fi: Tämä on erityisen hyödyllistä silloin, kun käsitellään tekstejä jos sisäelementtien muotoilu ei ole tarpeen (esim OCRed PDF, huono muunnos, .odt tai .docx jne.)

source: The segmentation settings only address the way the source files are handled by OmegaT.
fi: Segmentointiasetukset vaikuttavat vain siihen, miten OmegaT käsittelee lähdetiedostoja.

source: In some seldom cases the alternative, i.e. segmenting by paragraphs, may be preferred.
fi: Joissakin tapauksissa muut vaihtoehdot (kuten kappaletason segmentointi) voi olla suositeltavaa.

source: • Search in Files: search in a single file or a folder containing a set of files.
fi: • Haku tiedostoista: hakee yhdestä tiedostosta tai kansiosta, joka sisältää useita tiedostoja.

source: You can either enter the source and target languages by hand or use the drop down menus.
fi: Voit lisätä lähtö- ja kohdekielen käsin tai käyttämällä alasvetovalikkoa.

source: Reusing translation memories ...............................................................................
fi: Käännösmuistien uudelleenkäyttö

source: Shift+Ctrl+W
fi: Vaihto + Ctrl + W

source: See the section Preventing data loss for ways and means of protecting your work.
fi: Jaksossa Tietojen menettämisen ennaltaehkäisy on neuvoja, joiden avulla voit ehkäistä työsi menettämisen.

source: You can quickly see their contents by looking at their title: it will contain the search term used.
fi: Näet nopeasti niiden sisällön katsomalla otsikkoa: se sisältää käytetyn hakusanan.

source: • in translations: search in the target segments
fi: • käännöksistä: hakee kohdesegmenteistä

source: • Edit > Replace with source (Ctrl+Shift+R): replace with current segment source.
fi: • Muokkaa > Korvaa lähteellä (Ctrl+Shift+R) korvaa: korvaa valitun segmentin lähteellä.

source: Translated segments are displayed with the original text at the top and the translated text at the bottom, untranslated segments are displayed as the source only.
fi: Käännetyt segmentit näkyvät siten, että alkuperäinen teksti näkyy yläreunassa ja käännetty teksti alareunassa, kääntämättömät segmentit näkyvät vain lähteenä

source: The search term 'run*' for example would match words 'run', 'runs' and 'running'.
fi: Esimerkiksi hakusana “run*” vastaisi sanoja “run”, “runs” ja “running”.

source: • Editing
fi: • Muokkaaminen

source: Note that changes to the project setup may have some consequences, especially, when the project has already been started.
fi: Huomaa, että projektin asetusten muuttamisesta voi aiheutua seurauksia varsinikin, jos projekti on jo aloitettu.

source: The rule-based segmentation is usually synonymous with sentence-based segmentation.
fi: Sääntöihin perustuva segmentointi tarkoittaa usein samaa kuin virkkeeseen perustuva segmentointi.

source: Close Project
fi: Sulje projekti

source: Translate the file ......................................................................................................
fi: Käännä tiedosto

source: Until you have some experience with OmegaT, it is safest to consider all settings final once the translation has started – unless of course you realize a major mistake has been made.
fi: Ennen kuin sinulla on jonkin verran kokemusta OmegaT:stä, on käännöstyön aloittamisen jälkeen parasta pitää kaikkia asetukset lopullisina – paitsi jos huomaat niissä merkittävän virheen.

source: You may have several Search windows open at the same time.
fi: Sinulla voi olla useita hakuikkunoita auki samanaikaisesti.

source: folder).
fi: kansiosta).

source: Open the Search window with Ctrl+F and enter the word or phrase you wish to search for in the Search for box.
fi: Avaa hakuikkuna painamalla Ctrl+F ja kirjoita hakuruutuun sana tai lauseke, jonka haluat etsiä.

source: Open project
fi: Avaa projekti
